IDEA StatiCa Open Model
CrossSectionGeneralColdFormed.Radius Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Inner rounding radius between linear segments of centerline
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double Radius { get; set; }
Public Property Radius As Double
	Get
	Set
public:
property double Radius {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
CrossSectionGeneralColdFormed Class
IdeaRS.OpenModel.CrossSection Namespace